In [1]:
# from google.colab import drive
# drive.mount('/gdrive', force_remount=True)

In [2]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')
pd.__version__

'1.4.4'

# 문제 설명
* 영화 스트리밍 사이트 운영진은 등록된 영화들에 대한 데이터를 분석하여, 개봉 년도, 평점, 투표 수, 감독 등 변수들 간 관계에 대해 알아 보고자 한다.

DS_Sample_3.csv (구분자: comma(“,”), 188 Rows, 5 Columns, UTF-8 인코딩)

In [18]:
df09 = pd.read_csv('.\\data\\DS_Sample_3.csv')
df09[:2]

           Title     AirDate  Rating  Num_Votes  DirectedBy
0          Pilot  2005-03-24     7.5       4349  Ken Kwapis
1  Diversity Day  2005-03-29     8.3       4213  Ken Kwapis

# 전처리 1

* 분석을 수행하기 전, 상기 데이터를 이용하여 아래의 전처리를 수행하시오.
* 단계 1: 영화 공개 날짜(AirDate)의 연도 정보를 기준으로, 2005년에서 2007년은 ‘A’, 2008년에서 2010년은 ‘B’, 2011년에서 2013년은 ‘C’ 값을 가지는 공개년도그룹(변수명: group) 변수를 생성하시오.

In [4]:
df09.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 188 entries, 0 to 187
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Title       188 non-null    object
 1   AirDate     188 non-null    object
 2   Rating      188 non-null    float64
 3   Num_Votes   188 non-null    int64
 4   DirectedBy  188 non-null    object
dtypes: float64(1), int64(1), object(3)
memory usage: 7.5+ KB

In [5]:
df09.describe(include='all')

        Title     AirDate      Rating    Num_Votes       DirectedBy
count     188         188  188.000000   188.000000              188
unique    188         184         NaN          NaN               55
top     Pilot  2009-10-08         NaN          NaN  Randall Einhorn
freq        1           2         NaN          NaN               15
mean      NaN         NaN    8.248404  2489.787234              NaN
std       NaN         NaN    0.578720   924.986433              NaN
min       NaN         NaN    6.600000  1630.000000              NaN
25%       NaN         NaN    7.800000  1918.000000              NaN
50%       NaN         NaN    8.200000  2295.000000              NaN
75%       NaN         NaN    8.600000  2769.000000              NaN
max       NaN         NaN    9.800000  9269.000000              NaN

In [6]:
df09[:3]

           Title     AirDate  Rating  Num_Votes       DirectedBy
0          Pilot  2005-03-24     7.5       4349       Ken Kwapis
1  Diversity Day  2005-03-29     8.3       4213       Ken Kwapis
2    Health Care  2005-04-05     7.8       3536  Ken Whittingham

In [20]:
# case 1
# 단계 1: 영화 공개 날짜(AirDate)의 연도 정보를 기준으로, 2005년에서 2007년은 ‘A’, 
#         2008년에서 2010년은 ‘B’, 2011년에서 2013년은 ‘C’ 값을 가지는 공개년도그룹(변수명: group) 변수를 생성하시오.


# np.where(조건, True, 
#          np.where(조건, True, False))

# year추출 방법
# df09['AirDate'].str[0:4]
# df09['AirDate'].apply(lambda x: x[0:4])

df09['group'] = np.where(df09['AirDate'].str[0:4].between('2005', '2007'), 'A', 
                     np.where(df09['AirDate'].str[0:4].between('2008', '2010'), 'B', 'C'))

df09

df09[df09['group'] == 'C'] [:10]# 확인

,Title,AirDate,Rating,Num_Votes,DirectedBy,group
128,Ultimatum,2011-01-20,8.3,2002,David Rogers,C
129,The Seminar,2011-01-27,7.7,1904,B. J. Novak,C
130,The Search,2011-02-03,8.5,2065,Michael Spiller,C
131,PDA,2011-02-10,8.4,2048,Greg Daniels,C
132,Threat Level Midnight,2011-02-17,9.4,4236,Tucker Gates,C
133,Todd Packer,2011-02-24,7.5,1872,Randall Einhorn,C
134,Garage Sale,2011-03-24,9.3,3216,Steve Carell,C
135,Training Day,2011-04-14,7.8,1950,Paul Lieberstein,C
136,Michael's Last Dundies,2011-04-21,9.0,2598,Mindy Kaling,C
137,Goodbye Michael,2011-04-28,9.8,6909,Paul Feig,C

In [8]:
# case 2

# 단계 1: 영화 공개 날짜(AirDate)의 연도 정보를 기준으로, 2005년에서 2007년은 ‘A’, 
#         2008년에서 2010년은 ‘B’, 2011년에서 2013년은 ‘C’ 값을 가지는 공개년도그룹(변수명: group) 변수를 생성하시오.

# year추출 방법
# df09['AirDate'].str[0:4].astype('int')
# pd.to_datetime(df09['AirDate']).dt.year
# df09['AirDate'].astype('datetime64').dt.year

df09['group_2'] = pd.cut(df09['AirDate'].str[0:4].astype('int'),bins = [2000, 2007, 2010, 2013], labels = ['a', 'b', 'c'])
df09
pd.crosstab(df09['group'], df09['group_2']) # group 확인

group_2   a   b   c
group
A        59   0   0
B         0  69   0
C         0   0  60

In [9]:
# case 3 map 사용
df09['group_3'] = df09['AirDate'].str[0:4].map({'2005' : 'A' ,
                              '2006' : 'A' ,
                              '2007' : 'A' ,
                              '2008' : 'B' ,
                              '2009' : 'B' ,
                              '2010' : 'B' ,
                              '2011' : 'C' ,
                              '2012' : 'C' ,
                              '2013' : 'C' })
pd.crosstab(df09['group'], df09['group_3'])

group_3   A   B   C
group
A        59   0   0
B         0  69   0
C         0   0  60

In [21]:
df09[:2]

           Title     AirDate  Rating  Num_Votes  DirectedBy group
0          Pilot  2005-03-24     7.5       4349  Ken Kwapis     A
1  Diversity Day  2005-03-29     8.3       4213  Ken Kwapis     A

# 문제7

상기 전처리를 완료한 데이터셋(데이터셋명: movie3)을 이용하여 다음 7~9번 문제에 답하시오.

7. (movie3을 이용하여) 감독 별로 영화 흥행 결과를 알아보고자 한다. 여기서 영화의 흥행 변수 ‘success’는 다음과 같이 정의된다.

> $success_i=Rating_i×Num Votes_i$

‘감독(DirectedBy)’ 별로 ‘흥행(success)‘ 변수의 평균을 계산하고, 이 중 가장 큰 값을 소수 부분을 버리고 정수 부분만 기술하시오.
(답안예시) 1234

In [11]:
# movie3
movie3 = df09.copy()
df7 = movie3.copy()

In [12]:
# 감독 별로 영화 흥행 결과를 알아보고자 한다. 여기서 영화의 흥행 변수 ‘success’는 다음과 같이 정의된다.
# success_i=Rating_i×Num_Votes_i ‘감독(DirectedBy)’ 별로 ‘흥행(success)‘ 변수의 평균을 계산하고, 
# 이 중 가장 큰 값을 소수 부분을 버리고 정수 부분만 기술하시오. (답안예시) 1234

df7['success'] = df7['Rating'] * df7['Num_Votes']
df7
df7.groupby('DirectedBy').success.mean()
df7.groupby('DirectedBy').success.mean().nlargest(5)

DirectedBy
Ken Kwapis        32720.700000
Bryan Gordon      31096.050000
Paul Feig         28574.300000
Harold Ramis      26523.466667
Amy Heckerling    26301.600000
Name: success, dtype: float64

In [13]:
round(32720.700000, -1)

32720.0

# 문제8

8. (movie3을 이용하여) 영화 평가에 참여한 총 투표 규모는 영화의 컨텐츠 뿐만 아니라 서비스 공개 시기에 따라 달라질 가능성이 있다. 

영화 공개 년도에 따라 투표 수에 차이가 존재하는지 검정하기 위해 수립한 가설은 다음과 같다. 


대립 가설($H_1$): 공개년도그룹(group)에 따라 평균 투표 수(Num_Votes)는 달라진다.

적절한 검정 방법을 택하여 위 가설을 검정할 때, 검정통계량 값(A)과 요인의 자유도(B)의 합(A+B)을 기술하시오. 
-	그룹 간 등분산성 및 정규성은 만족한다고 가정한다.
-	툴별 가이드(python)

소수점 셋째 자리에서 반올림하여 소수점 둘째 자리까지 기술하시오.
(답안예시) 12.34

In [14]:
df8 = movie3.copy()
df8[:3]

,Title,AirDate,Rating,Num_Votes,DirectedBy,group,group_2,group_3
0,Pilot,2005-03-24,7.5,4349,Ken Kwapis,A,a,A
1,Diversity Day,2005-03-29,8.3,4213,Ken Kwapis,A,a,A
2,Health Care,2005-04-05,7.8,3536,Ken Whittingham,A,a,A

In [15]:
# ANOVA 검정

from statsmodels.stats.anova import anova_lm
from statsmodels.formula.api import ols

In [16]:
model8 = ols(formula='Num_Votes ~ group', data = df8).fit()
model8
anova_lm(model8)

             df        sum_sq       mean_sq          F        PR(>F)
group       2.0  2.362951e+07  1.181476e+07  16.028213  3.805527e-07
Residual  185.0  1.363677e+08  7.371225e+05        NaN           NaN

In [17]:
round(16.028213 + 2.0, 2)

18.03